from typing import Dict, List


# ______________________________________________________________________
APPLICATION_STATUS_MAPPING: Dict[str, int] = {  # TODO нужно проговорить все виды статусов с Юрием(что еще добавить, что убрать?)
    "Запрошен": 1,
    "В работе": 2,
    "Отклонено": 3,
    "Требует внимания заказчика": 4,
    "В очереди": 5,
    "Завершен успешно": 6,
    "Завершен неуспешно": 7,
}

APPLICATION_STATUS_FOR_KEYS: List[int] = list(range(1, 8))
# ______________________________________________________________________

# ______________________________________________________________________
APPLICATION_TYPE_MAPPING: Dict[str, int] = {  # TODO ДОРАБОТАТЬ С ЧЕЛОВЕКОМ ОТ 
    "MT": 1,
}

APPLICATION_TYPE_FOR_KEYS: List[int] = list(range(1, 2))  # TODO ДОРАБОТАТЬ С ЧЕЛОВЕКОМ ОТ БИЗНЕСА
# ______________________________________________________________________
