from typing import Dict, List


# ______________________________________________________________________
DIRECTORY_TYPE_MAPPING: Dict[str, int] = {
    "Пользовательская директория": 1,
    "Директория контрагента": 2,  # FIXME надо поменять в БД
    "Директория заявки": 3,
    "Директория заявки на КП": 4,
}

DIRECTORY_TYPE_FOR_KEYS:  List[int] = list(range(1, 4))
# ______________________________________________________________________

FILE_STORE_SUBJECT_MAPPING: Dict[str, int] = {
    "Заявка": 1,
    "Контрагент": 2,  # FIXME надо поменять в БД
    "Заявка на КП": 3,  # FIXME надо поменять в БД
}
